export const comments = [
  {
    question: "Q. 왜 개발자가 되고 싶었나요?",
    answer: `노트북 하나만 있으면 공간의 제약 없이 원하는 것을 만들 수 있고, 제가 만든 서비스로 다른 누군가에게 삶의 편의함을 제공할 수 있다는 점이 매우 매력적으로 다가왔습니다.`,
  },
  {
    question: "Q. 본인의 강점은 무엇인가요?",
    answer:
      "저의 강점은 사교성과 이타심을 바탕으로, 구성원 간의 감정과 상황을 잘 살피며 협업을 원활하게 만든다는 점입니다. 협업은 단순히 나눠서 일하는 것이 아니라, 서로의 감정을 공감하고 조율해가는 과정이라고 생각합니다. 저는 그런 분위기를 만드는 역할에 강점을 가지고 있습니다.",
  },
  {
    question: "Q. 성장을 위해서 현재 하고 계신게 있다면요?",
    answer:
      "사용해보지 않은 기술을 적용하는 사이드 프로젝트에 꾸준히 참여하고 있습니다. 최근에는 네이버 클로바를 활용한 AI 챗봇 서비스를 개발했고, 현재는 AI 툴을 이용하여 디자인부터 백엔드 구축까지 혼자하는 1인 프로젝트를 진행하고 있습니다.",
  },
];
